In [ ]:
#1
Missing values are values of a given column or row that is empty and doesn't contain a value.
Misisng values may sometimes contain vital data that are part of a dataset.They may lead to loss of data and incorrect inferences.
Algorithms not affected by missing values:Tree-based algorithms,Naive Bayes.

In [1]:
#2
import seaborn as sns
import numpy as np
import pandas as pd

In [2]:
df=sns.load_dataset('titanic')

In [3]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
#Methods of handling missing value-Imputing mean/median/mode in the missing cells
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [14]:
df.shape
df.dropna().shape

(182, 15)

In [16]:
df['mean_age']=df['age'].fillna(df['age'].mean())

In [17]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,mean_age
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,22.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,38.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,26.0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,35.0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,35.0

In [18]:
df['mean_age']=df['age'].fillna(df['age'].median())

In [19]:
df['mean_age']=df['age'].fillna(df['age'].mode())

In [ ]:
#3
Classification problems are those that have categories as output.
Imbalanced dataset is one which has extreme ratio of two categories.
Ex:Yes:No=9:1
This leads to biasness and biased inferences.

In [ ]:
#4
Up-sampling:Increase data points of the minority
Down-sampling:Decrease data points of the majority

In [ ]:
#5
SMOTE (Synthetic Minority Over-sampling Technique) is a technique used in machine learning to address imbalanced datasets where the minority class has significantly fewer instances than the majority class. SMOTE involves generating synthetic instances of the minority class by interpolating between existing instances.

In [ ]:
#6
Outliers are values in a dataset that fall very far from the range of the dataset.
They may lead to incorrect predictions and inferences.

In [ ]:
#7
Data imputation with mean,mode,median.
Data Interpolation

In [ ]:
#8
Missing Completely at Random(MCAR):No relation between the missing data and observed data.
Missing at Random(MAR):When data that is missing is related to observed data and not to data missing itself.
Missing Not at Random(MNAR):There is relation between the missing data and observed data.

In [ ]:
#9
We can use Up-Sampling and SMOTE

In [ ]:
#10
DownSampling and SMOTE

In [ ]:
#11
UpSampling and SMOTE and Data Interpolation